[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
0
1
2
3
4
5
6
7
8
9
##1
##9
##6
##3
##4
##8
##2
##7
##5
##0
12
29
16
19
10
11
13
23
24
14
22
28
43
15
17
45
39
20
48
25
33
32
27
##17
47
52
30
53
46
42
35
37
26
72
34
18
44
161
62
59
21
50
126
##18
243
80
66
31
##82
106
140
133
370
36
##06
169
67
247
76
202
283
55
134
79
282
57
##03
##41
56
230
49
41
127
64
300
317
459
##35
58
69
##19
227
426
276
54
##89
83
176
##59
87
217
##53
##24
##81
226
##11
##52
146
##88
153
536
##13
70
159
##12
77
##87
##34
##80
432
122
##85
431
##25
177
##09
##56
##84
334
##10
130
164
##95
522
##15
102
173
##83
##54
447
253
117
##04
92
##64
94
462
##57
629
##99
533
335
97
##16
433
246
453
##07
93
478
358
116
272
##29
168
142
347
147
##90
251
421
##61
223
##50
##97
##36
##02
74
##01
355
718
200
232
90
##55
114
264
304
##14
107
118
82
##51
208
##32
344
##62
##30
120
##93
524
180
##94
254
222
574
101
647
##92
416
##86
162
379
##58
172
248
212
40
481
903
163
229
##67
592
444
837
##31
192
525
360
157
##66
782
249
275
##00
1006
137
89
485
725
##65
##69
68
464
124
472
941
128
518
422
224
##98
221
##38
263
457
132
307
354
213
882
##48
220
##39
##96
##42
86
312
##47
451
193
115
##68
565
285
##37
189
470
1017
392
##91
277
800
##05
158
785
332
267
442
187
121
228
971
##49
541
135
##60
65
##46
1188
342
252
108
##45
##08
552
209
353
456
1635
365
773
348
##33
548
546
813
394
313
350
1053
553
314
336
606
455
152
345
794
##75
380
215
781
##40
618
266
295
296
917
698
956
454
406
279
1178
1124
329
136
##72
634
935
812
119
804
571
302
1593
382
75
1195
678
73
476
##21
250
495
338
63
767
240
330
583
776
311
333
646
1525
390
236
1640
##20
366
1592
1259
494
595
448
1203
398
922
1182
331
434
1130
##43
532
1652
290
461
297
1475
191
1661
471
519
652
337
692
141
657
1299
854
691
274
757
308
424
389
540
1097
477
396
818
309
440
##79
819
1277
550
##78
535
131
1596
175
1499
1012
787
1311
##76
643
521
711
1290
1642
918
579
##70
439
##44
499
260
71
526
1310
473
933
915
734
292
615
909
641
1135
1024
237
594
511
255
771
##73
635
95
964
328
1003
299
1338
280
435
762
1134
965
665
145
1555
707
1032
1002
352
262
1359
938
##71
1495
799
1174
415
561
853
123
##74
736
1347
138
988
1574
626
852
1004
413
505
1287
998
591
1236
538
2319
1104
1425
91
291
949
989
190
1263
241
623
810
148
1227
84
690
1329
1129
1162
373
178
566
##22
156
806
1110
96
99
1759
1584
1068
1275
233
60
395
2162
875
1364
1645
1021
225
889
403
196
1644
578
783
689
##77
265
611
612
1319
466
881
341
112
1089
1038
405
1430
113
361
671
1192
1403
705
575
270
919
81
1226
599
98
1325
1698
1100
981
315
920
239
367
1864
1424
1506
784
1133
1207
1426
1370
959
969
2260
1613
322
539
437
753
1209
761
1352
1431
990
2169
1286
642
1497
2643
916
1051
1493
662
878
1228
1789
862
1648
2641
706
829
861
850
828
483
675
683
1042
1536
38
856
1512
1326
1125
1101
2415
166
1059
542
884
1600
349
1803
864
500
155
808
319
381
397
682
1223
1394
744
359
507
1582
1365
1213
1556
1121
940
790
836
1675
474
590
1732
1619
517
739
947
830
693
1397
921
149
417
100
144
3034
719
409
374
197
1366
1570
887
468
888
980
625
310
506
1274
1680
2351
2006
914
798
603
826
984
1153
669
1377
1667
2420
573
880
945
493
105
2175
1231
1575
1854
288
1080
1993
402
684
2124
788
708
904
1085
393
261
1847
741
895
1160
1522
760
609
885
1958
104
1190
661
2487
1048
2089
1249
281
613
2037
824
2213
1450
1107
651
357
1322
356
1842
710
1116
1361
729
1389
1141
235
318
1094
823
2283
1027
598
1132
1401
1405
1649
849
2538
653
1438
2409
2909
231
1193
2066
1794
##27
2418
1723
817
531
601
514
899
467
1507
423
1935
408
109
979
955
593
3381
174
1568
1354
1491
1239
2436
369
1013
859
1206
194
482
1345
1087
1496
640
384
1282
877
1470
1786
##63
602
2434
831
1105
991
1235
1581
723
491
1526
2583
327
559
906
674
1760
520
1903
1440
1770
749
3828
1154
1666
372
186
925
1183
614
503
1758
942
1057
1184
1517
732
1461
644
2290
1769
1453
811
822
586
2170
1934
2483
1446
1139
2229
1245
2208
502
1899
679
6604
754
1618
103
110
479
1009
1881
1883
2636
681
1050
1136
508
512
722
388
2041
371
1466
972
412
759
1324
2879
324
1168
1170
326
2023
1211
1894
2113
3652
1106
458
1610
51
1928
2059
2454
2572
999
1822
2235
1276
740
1047
1022
1660
1603
560
962
2046
2687
438
554
1527
3087
928
286
1918
1553
139
1383
214
1333
463
672
772
2008
1307
1054
2272
986
515
407
1210
1025
513
897
970
1411
2000
78
1650
907
1653
2421
1208
636
269
287
3289
1088
966
1476
1868
2363
411
1701
3452
967
1001
2280
2732
632
1706
1518
1562
2047
568
1804
242
3316
1990
610
1624
475
154
1479
1331
961
1985
1008
832
534
219
1332
703
2601
1534
687
1092
1724
1353
170
181
2056
1328
1041
1095
3931
1816
873
1415
809
2656
3173
427
1795
2595
4622
1576
3284
301
726
1268
2764
2210
977
650
1267
1164
179
2067
2779
1763
777
608
2820
205
386
1832
216
3444
1545
2613
4160
3168
1019
1693
1448
2250
770
2612
1145
867
1007
2197
1622
1158
2187
1588
3748
323
2460
418
2448
2042
497
2746
1665
1205
1295
1559
378
1478
1877
1233
3604
2667
582
3361
1787
1872
1272
649
2109
5401
937
1109
1500
460
61
1063
449
2309
2061
543
2992
1011
3917
3062
624
4108
680
523
2191
1387
1378
1632
792
648
2030
3544
218
486
1801
673
1948
2580
2305
2765
704
963
1201
1368
1808
2281
1780
855
1219
1323
383
2349
234
1812
2328
851
1514
2707
655
752
3750
1445
1583
1745
2334
1819
3105
1811
1198
2536
866
1180
2029
2347
3329
3171
2327
1739
1422
3478
1381
1412
185
1252
3882
2906
2214
2799
3013
1672
1037
2172
3253
428
3617
3026
2198
2116
1913
589
1016
709
1564
745
616
2945
1654
1075
993
3092
620
1793
3096
584
758
1382
1316
##28
1995
1626
387
1376
1696
1905
2181
2269
2806
3270
2681
2463
2615
2472
2069
844
1643
1731
1396
150
551
600
686
2616
3804
1851
567
750
3271
1400
2706
4092
659
1688
1456
1647
1870
617
2464
1509
203
446
2192
1367
2996
2038
883
4942
85
1256
1853
791
1467
1045
4682
129
1278
821
1128
1685
1118
3639
2819
948
1560
2403
527
2692
1651
3331
182
1684
1551
2704
1756
840
443
3138
1488
2471
1294
2111
1251
484
1829
1705
1919
1014
436
1728
1664
1907
2600
516
2611
204
4201
857
2034
2357
847
2408
188
151
1662
637
1929
1852
1058
890
1548
1802
5624
3360
842
4224
1300
1035
3492
3175
960
1605
588
2244
795
3724
1280
1421
510
1388
2289
3151
939
1163
1625
1798
2604
2693
3402
1222
2121
715
1414
1379
825
160
1015
1243
3950
1052
2105
1878
1636
1337
779
1072
2125
1242
1123
838
4079
171
1186
6002
385
751
1656
1036
2190
1119
2535
2655
2126
1501
1834
2813
1473
1567
2354
2807
2317
805
3669
6100
2570
954
3116
2949
3308
1547
5531
2795
3702
2918
465
2306
2885
2022
2828
923
167
2864
2785
630
5238
1839
2148
3641
926
1363
958
2065
1577
##23
2114
968
1189
879
1943
3954
256
3224
5249
1998
3315
3479
2816
1289
2731
3714
1572
4091
273
2308
4262
184
5553
4727
1817
1330
685
995
2575
3215
1200
111
3024
976
1283
2013
4207
1615
1362
2401
2789
633
##26
1224
469
1874
487
441
3885
2288
2590
953
2080
2470
1248
656
1699
2176
1902
1391
2356
340
480
1774
886
2407
2209
2075
664
2679
429
2346
5070
3701
2872
339
528
8484
619
607
1185
3016
558
3041
2122
4369
2027
2988
1906
2630
4440
4172
1788
2102
789
1999
1540
4891
3162
2830
1671
1747
2555
3964
724
975
2320
786
271
735
1336
5168
973
143
2860
2680
1465
1144
1181
645
2177
3141
5138
2375
2039
2073
3093
4635
351
2534
3761
913
3248
278
1293
1954
1187
211
766
1920
802
5307
841
1212
4681
5066
1730
2873
420
1159
1687
1055
1196
2682
3856
892
1147
1284
1034
3204
2152
2107
2405
1857
934
4468
702
848
1682
1702
1194
1835
4169
1543
717
1117
1513
1585
5257
985
1967
670
872
2323
1049
2316
5354
2546
3883
293
2987
803
2098
2501
3220
4026
199
1260
931
2513
2835
1520
1945
1996
2573
2156
2304
2011
2585
2343
1484
3470
3803
3135
2461
738
3738
4141
1302
2921
3620
871
2912
1120
3474
3543
2776
1031
1858
3667
2369
2282
4355
2119
3611
3649
4226
1504
1443
207
2769
2174
2392
3296
737
2017
3797
2625
3431
1061
2527
816
2658
2261
1646
3322
1314
425
3829
1904
1150
2397
1710
4803
3498
2115
2117
3919
622
1177
1321
3705
1023
2775
3815
1658
2686
1142
2019
183
4325
294
676
4337
1994
2419
2178
1292
165
5325
3458
1911
3032
944
3351
1697
911
4759
1358
1719
2688
3139
4641
580
489
728
1897
2727
2540
2241
488
3526
1657
2077
5986
4642
1202
1398
3581
1979
1515
727
2560
1317
814
3918
572
404
1452
2550
1676
1729
1796
2292
2502
1974
2402
2882
4517
3129
1549
2530
2627
1093
1103
1197
4324
1597
997
1257
1617
3747
2833
1386
2866
4652
3766
996
125
1417
2082
258
5472
835
1137
2361
1468
3898
1976
4749
3074
562
1503
1716
5084
3015
1416
3760
1079
952
1792
1173
2773
4175
3978
2135
876
604
2504
3494
4596
4338
2974
206
1609
1018
2076
3390
1709
3588
7237
2728
1126
450
2108
2842
4485
3043
4000
1528
3936
3993
2745
3276
3193
577
5479
992
1395
2202
2743
4203
4933
1166
3143
88
2053
1459
2596
3359
321
320
3250
545
1805
4420
1931
1748
4894
2718
4206
2165
1264
1462
2984
399
4858
3055
4455
5808
1240
893
2845
4593
2856
2557
3343
##558
3709
4012
3376
2224
2085
2144
797
6461
1464
4025
654
4986
1074
1070
5158
1306
3991
2079
8092
2449
3158
2850
1402
3608
2957
2332
289
1927
716
2007
2060
3123
1602
2818
1791
201
2598
930
2230
6237
7799
5922
5194
7106
2801
1715
4252
2130
3827
2622
902
1972
4015
3387
6656
5145
1350
2355
3612
1342
5653
1056
3450
5980
501
3657
2777
6030
2358
4781
6755
2626
756
363
5772
5439
2574
2629
2631
2232
2757
2610
3451
410
1369
2366
1712
2010
1914
1978
1083
3368
6269
1915
2064
5312
2839
5227
1628
5183
712
1566
1862
5038
2979
2994
2940
2810
3056
1814
509
6468
2291
3920
257
5203
2995
4883
4409
8400
5178
3871
730
4230
2142
4159
587
7043
6853
1157
3925
3525
3536
4195
3027
3378
2074
5912
5967
1637
3370
3726
6377
1704
316
569
2005
2548
3814
1115
3514
4154
1146
5198
6866
1516
3757
5406
833
894
1309
2567
2694
2101
775
748
2227
2991
244
2424
3481
780
4068
198
2865
4163
4640
3897
1221
2329
1741
537
5965
3659
1530
3902
4929
5119
5105
3502
3782
6735
6798
1220
1655
2488
3112
2831
2676
1046
2892
1785
4672
1895
5948
2146
1305
1463
4019
1390
3277
5285
4691
4454
2333
3960
3052
1833
3154
1296
1114
4804
544
4031
7558
1230
2444
796
563
4728
2414
2511
5037
4136
6936
1304
4580
4834
2561
306
4299
3410
2106
419
846
3375
1831
5498
7538
1987
7577
1970
3535
2301
5103
210
6642
1762
1773
3860
6855
1988
1951
1084
1492
4204
1887
807
677
4643
4814
4610
3776
5669
2549
1244
2774
3559
3614
5496
1594
1472
2216
4595
929
2952
1946
2400
2234
284
2796
5344
3678
4314
8494
1281
1909
4216
2129
5787
2531
1318
1437
5253
3610
4261
2768
2973
6926
3186
912
530
3578
3100
4964
3421
2581
3306
8313
3183
7033
2427
2150
2143
1563
6124
1944
2399
3679
4110
3340
742
4097
1966
1152
4557
3970
3499
3708
1102
2447
2099
3285
1694
5775
298
4229
3778
1818
667
2532
863
2841
529
3086
3783
1247
858
1960
1111
3083
6647
4223
1711
4552
3895
2412
7215
3192
3675
4119
4137
1176
2646
2315
2417
2299
2876
3365
3059
1523
4558
3045
4007
3923
6591
2938
4710
4758
3593
1776
3070
2675
3896
1298
2904
2002
3094
1265
581
2647
2763
1521
7035
1949
2255
2740
2824
2173
4537
6073
2930
1713
5255
3625
1764
1537
3345
1384
1790
377
3767
1060
2475
1544
2437
6788
2411
2256
2295
376
3131
6955
6306
982
2969
3217
3417
4148
4475
1237
2455
2800
2805
3966
2599
3318
3247
596
1346
1686
4028
4027
2394
2855
2878
3242
5397
2193
4326
4536
1374
5171
1442
2297
3385
3290
5209
3407
1885
414
3342
2533
1320
5124
2040
2138
4122
3350
2246
3891
1487
4568
5293
2104
2478
547
1169
3927
1086
4503
2185
5059
4958
1455
3280
5346
2617
2662
2160
3149
4149
713
3221
4746
5097
1349
1532
5361
4327
910
1669
1510
2700
2609
1840
4437
2826
4471
1099
2429
2869
452
4456
3653
1469
4011
1573
3995
5264
5324
1175
2950
1542
3014
4634
3577
5988
3672
5757
7752
3446
1373
896
1890
6274
4146
4183
4188
2854
4567
3909
4697
3722
2695
1815
2145
4164
1225
6843
1098
2497
1434
1451
3520
4977
4089
1498
2597
6620
3706
4113
2505
3716
2469
3835
1932
1315
3210
5311
2690
3465
6736
5473
2204
4317
2787
303
5684
694
8605
5135
957
1634
2093
3362
3515
1722
2496
2374
2954
2849
1880
1408
1335
9478
2542
3523
3830
4046
1953
1981
1734
4704
4258
3512
3405
5910
3676
7984
1229
1077
1199
2336
5382
3790
1820
5036
1266
4902
2670
2423
1138
2396
2524
2568
3119
4111
7038
2937
1683
1962
2515
4766
3037
1844
5991
3655
5665
9053
8145
1297
1355
2753
4249
3503
2651
2164
4909
4227
7330
6177
2009
2525
5300
2618
3159
2547
4648
1392
1753
4849
5250
2179
2720
4003
860
3127
1959
3969
3729
4416
5058
5573
7762
2467
1474
2221
2298
2243
5132
2966
3983
2594
2134
4474
8277
1081
2303
2217
2788
2715
2747
5334
4630
4282
4219
3519
3755
1612
1533
1800
1923
4033
8672
2338
3218
8040
4106
3176
5467
8656
3834
8671
983
1482
1413
3946
4861
3025
4231
5628
4478
924
1940
1490
3002
5336
1720
1372
2770
3022
1254
2410
4374
4824
2556
2558
2724
5231
1884
5456
1460
3075
7898
1629
2452
3961
3257
5200
3099
4237
3576
2691
6638
3943
3893
8561
688
1091
1399
4524
2003
2090
4600
6967
2267
2223
4058
6142
4187
1419
1485
4523
3916
259
3211
5268
5396
4278
3765
1407
3661
7451
3363
8486
5142
2055
2051
2508
2577
5125
9990
1447
3924
4831
5275
3050
3505
1856
5995
2476
5705
2240
3545
6364
6824
8244
2908
195
1313
1535
3251
3529
5013
5652
5878
2247
8197
5144
3723
5120
1112
1718
4618
3432
1837
5900
5702
5733
5776
564
5884
5441
6474
3126
6017
1113
5555
3009
3044
6132
10386
994
2998
1659
4236
3743
2158
3161
6496
3327
8137
7394
9583
7527
4565
2092
3229
4743
4636
6418
8657
1933
1876
6021
5267
4666
4288
3416
5906
5516
6122
6825
4099
1980
238
3994
3364
3241
7931
5712
1579
2628
5137
11182
901
2364
4860
3232
2725
3504
3562
5014
4269
4628
898
1879
2744
8525
8832
6563
815
1781
1746
4241
3589
4494
2838
5403
9268
1726
7871
6160
1216
2492
4868
5252
3461
3433
621
5961
498
4919
7768
2539
5333
905
2642
1633
4644
5197
8885
6564
1480
1436
3200
4665
2307
7445
3071
6022
1156
1505
3775
3484
5095
2432
3666
6953
7721
6298
6473
9964
6823
8463
2985
2484
1483
2054
7468
2321
4220
3078
5415
3940
2976
7077
8875
2252
2759
4602
6633
3118
6765
6749
5600
7495
4002
13793
6574
7113
869
1234
2390
2342
2014
4806
3330
3643
5540
5642
8259
4447
2678
6069
1984
5251
3406
1825
1866
2188
5071
1343
5872
9790
9050
2521
7193
8928
1096
2886
2870
1519
1557
1546
3976
2798
5395
12603
4124
1270
5830
6475
1039
1494
4501
2018
2044
4247
7211
5949
5054
4930
4992
5471
8304
6472
6519
8181
2989
2947
2944
1678
2206
4879
2710
4762
5299
2657
3441
1809
5093
3670
5588
6969
4268
9307
5928
3079
9196
1253
2495
2893
4359
5237
3740
6412
5179
10186
1217
1040
2859
2868
1580
1750
4818
3272
2735
5306
4656
5908
4981
7760
4331
7478
3922
5323
10004
7173
401
1454
2031
2578
1810
7986
927
2633
3122
1871
6129
4074
3866
1901
2490
2736
3089
7264
3166
6776
7603
5718
4162
3170
1623
400
2978
6137
7320
3838
7521
7354
2891
5270
4289
3741
4418
5974
5567
4910
4915
4931
6434
6442
5221
2491
7519
7337
7569
1489
2804
3982
2541
4736
5958
2153
2832
4983
5434
5330
3928
6384
3817
950
3988
3313
3243
4731
3082
3524
4464
1269
8085
7681
4107
4570
1250
2916
1910
1385
2045
4859
2582
2589
3299
4789
2182
6615
5459
7081
9785
2222
4056
4061
2377
9106
6003
3816
5026
10950
4678
6261
5511
5222
4473
9303
6033
7100
6140
5101
714
1916
1393
3957
3962
4711
4790
4673
3574
627
3662
5707
4144
6435
3177
5856
8224
9223
6597
1010
2489
2258
3264
4291
3713
2606
1867
2155
1692
5596
4936
1148
8903
9352
10966
5129
6370
1971
245
4342
2587
3332
5294
2760
1428
1607
1969
1357
2456
2091
4896
2780
2786
5216
4650
3735
2103
3693
6722
5505
5738
8601
4062
7679
8456
9673
2953
1418
1435
4360
1589
3949
2071
5210
5384
3403
6203
6719
5804
7448
2640
9695
9935
6098
2458
2422
1754
4535
1850
5964
5931
2825
1271
6958
4024
3188
10885
10110
14921
1214
1232
1968
1312
2843
1529
2094
5389
3727
5053
2433
4963
4145
5875
5460
6293
7858
3663
4070
10526
11527
2380
2889
4302
4534
2088
2562
2591
5283
3552
3590
1888
663
3117
3665
555
7975
5627
5417
5430
8717
1639
4645
9607
4170
3563
10397
3872
2929
2920
3945
3304
3256
4791
3036
4657
1824
5566
4984
4932
4979
8321
2120
8952
4726
6343
6019
6627
4023
6846
5149
1939
2441
1429
2507
4793
3019
4625
2632
4413
6652
5667
6482
5431
1779
4445
8980
4647
5188
2896
4895
3397
3209
5232
5313
4295
3531
3430
7682
5785
5488
5490
5442
7749
4010
3373
4773
4021
3844
11991
1449
3302
4794
3031
7298
7240
4482
5571
7974
5655
1778
11739
2462
1420
8618
6133
2803
4527
4893
3382
2797
2739
3718
4452
5752
8774
1638
8118
6848
6094
6801
3463
4460
5060
5809
6949
1149
5748
2128
4080
4444
7823
7856
2672
7388
6155
6031
7177
2936
2057
4800
4735
5380
3560
6248
7667
7089
9273
9314
4088
7827
8425
3806
10074
6196
7805
1380
2340
2425
4391
2036
4890
2564
5260
2664
1836
1896
4419
5069
6739
763
5502
4901
6947
2273
5494
839
10212
7454
11557
9934
7833
6362
6162
8423
1689
2287
2284
3357
5295
3010
4677
3739
8098
3603
6763
2477
5620
4907
5865
5245
8131
10125
6411
8153
3228
4020
7108
3185
5147
10077
6156
1681
1925
2257
4518
3959
3314
3268
2738
4787
4613
375
2669
3637
7604
5577
6950
9325
1721
5463
10579
6040
2482
2446
3972
2062
3372
3292
2791
4795
4661
4451
6270
5966
5088
6667
2834
6446
5896
7484
4052
7317
9618
6081
9046
10382
2999
2382
1441
2881
4313
4801
3367
2741
4724
2652
3483
3613
6764
7991
6291
1161
2722
9564
7574
11301
1285
4836
3203
2737
2163
6635
6703
7691
557
5625
4968
4117
##971
4050
2296
1921
2205
6356
8436
9595
4823
10366
11370
6547
2084
3312
3366
2792
3752
2614
7631
5537
5694
699
6921
8360
2226
7369
6144
6135
7129
1241
1288
1641
1000
2386
1735
1707
3958
5254
4259
4234
7274
4415
5034
6767
7649
7660
5793
4914
4109
5445
1301
4472
8227
3533
8138
7325
9228
8523
10133
7892
10997
843
1668
1952
1410
1717
4867
5219
2621
3424
1843
5547
2821
5765
5629
2300
4973
4152
6456
5889
6929
8322
9408
8200
13219
2137
8107
5155
2981
1030
1122
2388
4356
4350
1725
4546
4528
3930
3267
5356
4273
5672
7086
4083
8906
2139
868
7311
3813
3728
11804
6174
6192
1043
1356
2372
4382
1587
1586
4881
4880
2586
3225
3254
4685
2650
3466
4405
5959
368
6450
5818
5452
7761
4168
1327
6571
6570
6009
6598
639
1082
1714
4208
2607
4496
5984
5962
5930
5030
6651
3125
6792
5409
5475
9769
7406
6184
7553
6315
7114
9619
9904
1963
7841
7523
8584
2352
2350
2552
3219
3231
5225
7220
7278
8013
6636
3146
2473
7639
2277
15311
7759
11613
5747
5528
6151
7194
8951
951
2207
2840
4507
4821
4737
5393
2665
3195
10667
6706
5762
8380
7725
7738
10752
8252
6342
3028
3377
9664
9961
6839
8646
6109
7150
1215
1204
2330
2259
4380
2703
4287
1344
4132
5853
6902
5480
12291
6292
8233
4053
4085
2778
5526
6838
1255
2961
2901
2359
2808
1524
4855
4748
3088
4659
3753
3469
3437
5067
3199
5518
5648
5679
4103
3004
1531
9318
8216
5243
5744
6504
3820
6007
11236
10439
1950
1947
2389
2381
2285
430
3973
4780
4693
2654
7202
8077
14071
6756
6710
2020
4938
12735
6454
1766
5368
778
4329
9266
9482
4004
1873
3825
7535
2371
6016
3846
10477
987
2457
2871
1782
2035
2510
2529
3259
4761
2608
3455
6271
5968
2166
3656
5810
5850
7078
7748
3600
6922
3819
6035
5023
7226
3886
8674
11118
845
1218
1956
2802
3971
4852
2593
3336
3237
4279
3550
3770
2602
721
597
5940
6625
6673
764
7605
5538
4978
5890
697
1775
9211
9796
4332
3549
7395
10318
11082
18397
1604
1090
2857
1552
1752
4560
3929
4843
2592
2754
5297
3081
3564
1807
4489
5919
5024
768
5701
4937
6464
6467
6431
5832
6957
7007
7767
9263
8215
6471
2249
7855
7301
12312
5140
8902
9977
9027
8940
2311
2218
2500
4792
3003
3039
5345
3510
7246
3434
3485
1841
6289
2154
5007
3156
3132
5506
6438
5891
5424
7702
12203
4476
10782
1926
8820
6301
7872
9152
9941
7842
7065
8292
10462
5143
10878
8116
8976
8920
13131
1989
1900
2087
3582
3737
3467
8035
5546
6909
5404
1595
1777
10207
2465
6479
1631
3548
5527
6316
7118
10242
8434
8164
14442
7322
6320
7528
7897
11174
11023
2946
1541
1511
1554
2068
4813
4615
3754
7218
4480
5080
3164
362
3648
6708
2025
7930
576
4987
6488
5847
6916
10211
1737
4428
7583
3894
6423
6827
7328
8114
5121
6365
8476
8422
9532
1983
2459
1565
1799
3395
3230
3584
2603
720
3490
4458
6253
6273
6227
5914
3682
12722
6956
8729
10290
9448
9721
1471
4723
4421
5522
7306
7877
8440
9692
8872
3887
6366
10148
6569
11027
1486
2004
4878
2702
3585
3572
7256
7205
4417
5090
5033
6671
3686
7657
7602
5513
5639
4101
6449
5883
6992
9440
9774
2238
7489
7405
4579
6506
9172
12033
9151
5113
8417
6115
8846
6821
10941
9622
9669
15489
6169
7374
2917
1757
3989
2012
4815
3338
3213
4783
5259
305
3018
7267
3412
2167
8016
8071
7925
5799
4940
5802
6937
5436
4323
2721
7473
1620
5926
5184
4426
5416
7588
6112
4663
6832
14486
7190
6138
8246
8110
6141
3878
9026
2965
1673
1457
4510
2793
4714
3541
3537
3715
5924
5985
2157
6600
6660
10668
5550
6405
8325
8796
7048
1165
##551
2645
8217
7825
10067
8688
8609
3422
5193
7878
7345
9612
6052
6809
15029
8575
2384
2254
4514
2083
3300
3206
4706
3080
3061
3098
2684
7285
5944
3153
3111
3163
3628
7924
5708
5622
6903
10213
##555
5923
2498
2637
3542
8826
##333
8132
6063
7115
7628
9893
6116
11325
4171
4093
10478
7039
8677
9933
8576
2956
1924
2416
2445
4586
4835
4886
3341
4768
3507
3736
6286
5982
5904
5971
2136
5083
3104
5510
2827
4961
5806
6966
2762
1738
1427
10109
4051
13773
8967
2772
6552
3374
6623
3859
4098
3181
11549
6079
8416
4044
15198
12327
1997
2293
2815
4345
1561
2584
2708
4764
5288
5279
3583
3567
7253
7236
1882
1813
4408
6277
5946
5976
2140
3136
10695
3635
7625
5788
5671
4922
4156
4591
7715
1179
11705
9213
9475
4620
10796
4005
2639
7393
12034
6831
8647
10587
10944
11084
7591
5117
6544
2406
2440
2848
3937
3905
4829
4832
2717
2705
4785
4624
4660
4271
268
2634
2685
1859
1869
1898
4410
4462
6204
5081
5096
6686
6646
6643
3196
6761
5545
5770
5633
4994
6440
585
6973
870
7042
7798
10261
6297
7499
7466
6512
3807
4763
8540
7571
5111
14524
10048
8418
9911
6820
6130
10911
6149
4078
7817
3877
6005
8691
2959
2353
2481
2286
4388
4368
1508
1744
4540
2015
4884
3287
3060
3033
3565
4490
5901
1404
13417
7990
5777
4985
12783
6441
6439
5807
5476
8349
7704
9787
2233
7475
11441
8235
4448
15859
2522
3809
2663
6311
6397
14118
6024
6013
7531
8622
10059
10466
6043
9101
15104
1606
1992
2376
1784
3951
325
4796
5207
3414
1827
6245
5969
10607
7606
5515
5563
7945
5734
6459
5862
6976
5228
7409
2648
10744
8281
10171
6389
6355
3522
6530
7500
8251
11891
8865
11594
10831
7136
1917
1131
2215
1703
1797
2072
5273
3067
5385
5320
4246
7258
7231
7248
3419
6242
5942
2132
5016
8042
6699
6629
13342
7607
7696
7621
4125
6906
6961
5487
14635
7418
9019
2649
8918
6803
6517
2520
8125
3822
7338
6338
5322
6891
3182
7593
7036
10197
5827
13165
8510
8420
7166
10560
9822
9502
1982
1961
2451
2817
4319
1700
3380
3384
3262
5265
5341
7286
2189
6696
5562
4911
3007
6971
8388
1598
11629
7435
3798
8372
6861
2771
11349
8482
4039
10009
11534
7102
7105
3187
8999
12068
9065
11062
5139
12907
7867
8411
8142
12972
2907
1303
1360
2348
2814
2846
4399
4520
3985
2095
2519
3399
3235
3239
4755
5272
4667
3785
7262
1860
4438
6278
5934
5050
12629
12622
8012
8075
6690
3638
6712
6779
7665
5780
4956
6954
4264
5465
8710
8754
7776
1029
9491
9443
9797
4214
7444
8234
2543
4009
16389
6864
11956
6341
6304
9183
9646
8441
8461
9989
6123
14978
9840
17940
10546
6367
7522
6166
14177
9108
14104
1608
4361
4845
5319
4611
3532
1821
16146
6674
5557
7946
5716
5605
5466
1767
7004
7029
12274
11790
9289
9285
10706
16284
7826
4221
5413
3427
3802
4063
3826
6324
6325
9699
12079
8848
10511
7104
10961
4072
6363
6118
7157
7169
1238
1432
2251
4387
4385
4383
1550
1783
4553
4569
3965
4846
2588
3201
3260
2709
3066
5314
4671
3509
3521
5994
5074
8003
3690
6796
7619
5591
2302
4989
4928
4923
6455
2279
5448
5468
8382
8394
14601
14667
700
7714
4321
6299
11657
7459
8203
8283
13278
6580
6185
7344
2923
6053
6085
4173
6845
7413
10430
9558
7223
5154
9674
6555
6596
3855
7358
6883
14190
2395
2862
1742
4585
3906
3935
3913
2081
4844
3369
3234
3095
5390
4607
3501
3500
3786
2659
3460
6244
2180
2184
2147
10646
3645
6757
7662
5541
1340
7982
5695
4955
5477
8732
4786
11474
4059
8545
3892
7116
11355
10056
10959
11840
9672
9675
8675
4189
8477
6854
6540
2962
2219
2867
3281
3266
3233
3273
2714
5211
5358
4270
3719
7299
7250
1893
4424
4463
2199
8022
3694
3640
6724
4974
4143
6465
696
8731
8763
7011
1599
2537
9780
9779
7181
8232
12088
12425
3326
2671
6332
8469
6004
12076
8568
10029
6136
11166
8177
12192
6172
9945
12501
2982
1601
1630
2314
2253
2899
2874
2877
4559
2052
2559
3214
5359
3486
6634
3145
13327
3626
6789
5590
7934
5790
5658
5831
5871
5481
8333
7075
17365
9407
14770
7470
10795
10739
1578
8989
8934
2528
10853
8121
7541
7381
9182
10032
6051
6896
7843
8569
8842
10017
10003
9801
9049
10438
10547
7030
8670
11094
8509
7350
11177
8358
8889
13842
9825
2964
2900
1957
2324
2385
4581
4892
2566
3252
4718
5374
4662
3599
3435
6254
6222
8083
3160
6734
6793
6721
2024
2823
5710
5603
5662
5608
492
4114
4121
3005
5833
5499
5449
8795
7006
7026
12260
943
4533
7428
10710
11817
2220
6818
6511
10531
3021
3371
14510
11292
3227
9161
7062
8640
14985
7419
11832
11010
6805
13167
6868
6594
11198
11197
13146
13061
7308
14825
11129
14367
8698
2902
1955
2312
2362
2413
1481
2875
1569
4513
3956
2001
3317
2719
4753
3058
3780
2619
343
3457
4495
16134
6218
2149
5047
8089
8061
3137
14015
1339
7688
5517
5758
5615
4917
12764
6437
4590
6962
5486
5443
8341
8324
12200
4470
9238
9313
11607
3475
7479
8210
2544
21207
4449
12402
4574
8824
6060
2971
6572
7876
12316
4037
11318
9190
4176
9040
8958
10492
10433
11901
8990
10906
4180
6865
6379
6197
9830
10107
2903
1908
2318
4812
4875
2506
2565
3282
4707
3085
4699
3595
3787
1806
5915
5993
3124
10620
6748
5508
7958
5720
4998
5800
6911
8711
1590
7764
3346
1733
11788
11727
9449
9321
9320
3440
12053
5242
17274
9033
12464
12477
2245
2133
13518
13553
3805
4064
7318
6329
5195
7579
9150
8102
8431
11297
6011
8810
6092
8858
8592
11849
10226
10549
17024
13878
7529
6869
11187
11940
13555
9242
9245
14197
2913
2345
3908
4808
3278
5239
3068
5318
5303
4605
2683
7216
7294
4402
2118
2196
6672
3167
10616
3703
3695
3699
5597
6422
5882
6910
6999
5483
8312
8393
1765
2171
15300
7775
7772
12254
10265
9708
1078
10124
4087
7514
8548
4774
9507
7074
11921
8124
14246
7537
8298
9848
11412
8991
10983
9623
1826
12838
6077
7357
14175
9824
12346
2934
11555
2313
2310
2404
2847
2863
4341
3941
3914
3939
4840
3339
3396
2742
5258
7234
7243
3489
1849
4497
6287
5925
5001
6648
3684
7686
5544
7942
5609
4947
4129
6945
6978
17654
15314
15342
7724
7734
7739
9427
5339
9304
11440
10751
10727
5246
10064
2677
6587
3420
3808
11981
7340
11046
11047
9634
9986
4032
11339
9814
10557
8179
6014
18999
7032
4186
16322
10377
8839
8257
11814
8922
9113
20531
14802
14944
1108
2387
2453
2888
4376
4548
3998
4857
2569
3283
3298
4740
5201
3029
5391
5372
4638
3794
2653
7295
2159
2168
5048
5020
14096
3692
5619
5640
4134
8316
8741
8792
7041
7027
10296
11717
9218
9719
9767
9776
14216
7458
16231
4081
1375
13719
6862
12447
13205
8687
15207
6361
10975
9158
9157
9093
9514
12388
8460
9616
11381
11330
9881
12865
6428
8296
10592
15503
4179
7197
8870
10550
4022
7412
3842
9060
9257
13941
13833
6107
15494
10072
4185
8665
8588
12915
6191
14330
7178
17196
12504
11125
631
2955
1930
1991
2325
2203
4307
3942
3293
3258
4732
5230
5357
4639
4242
3768
2624
7235
7255
7266
3404
3493
4465
6256
2112
3152
10669
3602
7695
5532
5500
13441
7957
5717
5703
5713
5730
5664
4155
5866
5860
6933
5440
834
8315
8756
7098
7795
12225
10285
9252
9279
9718
9755
2468
9333
11625
7438
7188
10730
17208
15727
1371
8930
13284
3547
6582
6557
10806
15268
7812
6188
7585
7584
7554
6523
6927
6150
7627
12399
7363
9199
3818
8876
9144
6093
10436
16660
6147
10574
7592
9994
9626
10255
5829
15010
10362
9542
7868
11599
8161
8806
7801
12813
12348
17549
12147
1938
2365
2337
2485
2883
4395
4547
3952
3977
2516
3324
2752
2750
2701
5224
3011
4651
4275
4240
3763
1838
2141
5046
3150
6753
6783
7911
7950
7951
5691
3179
5812
5840
5495
5457
8343
1761
8790
8797
2268
14687
15940
17382
1171
9310
11686
7440
11448
5247
8659
3121
2673
6535
15221
6382
6381
5192
4770
12773
7110
9186
2928
5110
12361
8495
9603
9656
9637
9962
7830
6114
10890
14977
8565
10596
8886
6840
10858
10400
17495
6020
6148
10306
10312
7852
21989
17918
3869
13821
3876
11185
10142
7151
10158
10369
7359
11875
7174
11978
13902
9942
8150
1258
2919
2997
1964
2486
2294
4304
20971
4854
4869
4805
4874
2503
2509
3279
2730
5208
5355
4683
4670
4467
6241
5082
5042
2431
8094
3114
1064
10659
13339
3707
3658
7612
7658
7983
4967
4104
4105
6457
5877
5461
5420
8781
8750
7090
7797
16444
1736
9274
9494
9799
9739
9778
9334
7436
7402
9056
11472
8376
12469
12491
9412
3076
6349
6340
7587
7334
7398
7670
8547
6158
10028
9697
9969
8898
11215
9819
9834
11333
5174
13972
14934
7880
10854
6099
8854
3845
9428
3884
10254
6161
11591
12920
6549
11562
14188
18137
2494
4519
3992
3974
4856
2512
2554
5383
5386
3553
3762
2635
2661
2186
12639
12649
6684
16901
6741
6781
6727
7601
5536
7927
5696
12745
5863
6983
7082
7010
7095
7054
11731
9224
9483
4339
9394
16881
9005
11425
10703
10799
10716
10707
4166
1922
1571
10061
8935
4572
4705
3321
12106
6181
11243
11242
11989
7518
11950
6380
10127
14817
9995
1127
11382
11928
9817
8648
6828
13946
10082
10801
8993
12352
9256
12111
13964
13916
6152
6802
18116
10160
3875
15053
6170
12565
12944
5160
5104
8256
6308
8168
9960
7561
14928
11022
9838
10305
2925
2887
2809
4386
4358
4825
3337
3297
3269
2781
5256
5202
3035
3554
3773
2697
7225
7279
5975
5086
5005
8088
3113
10683
10647
14053
6794
7613
13493
7916
5721
5651
4946
4135
4153
1279
12714
6462
5815
5858
6952
5478
8303
2264
7008
7719
12271
1308
16431
10279
9215
9290
9768
9773
11675
7185
9080
11443
10735
13706
891
8929
4646
1246
12468
12861
5410
6518
6067
15216
9175
6392
6337
9541
12311
8424
8430
15683
9981
6006
13645
11272
9597
8508
5176
8595
9426
10364
5109
13962
6360
10419
12197
7520
13811
8444
6171
5166
7890
11508
9979
9104
9574
14130
6885
9014
12508
2968
2905
1942
2493
4301
3934
4897
3301
2790
4709
3057
5387
5378
5376
4688
4684
4243
2660
7244
1889
1886
4429
4492
6224
6285
6221
5911
5987
12640
10601
13395
3674
6732
7938
5711
5732
5634
5604
4191
12769
8318
8331
8708
14611
14625
7001
7072
10231
946
9434
9409
9789
9748
9720
4336
4538
11679
3471
7482
7424
7474
1143
11404
8275
3447
12009
10152
8374
7822
13712
13747
8911
2242
8689
8684
8693
13581
7733
11967
7511
7507
7314
6319
2970
14152
12998
7576
12774
9180
10246
9535
11342
14519
14889
8401
9988
8813
11399
9859
14248
9599
7533
9169
5173
7883
10405
10918
10314
7228
13918
4076
6101
6500
10078
11092
10371
6595
8503
18487
18433
6562
8863
9111
8144
14523
15038
7163
18856
12855
2335
2393
2398
2339
2368
2442
4820
3398
4745
3053
4286
4248
3511
3587
7287
7201
3480
3497
5935
5938
5978
5051
5022
8034
8067
8049
6661
6691
3106
10655
10651
10642
14004
1691
793
570
5700
5614
12729
5864
5846
695
6991
8787
21762
15333
7018
7000
12276
13047
10230
11745
9264
9446
9707
9794
936
11673
14205
2231
11496
8278
12051
5248
5743
4008
15797
12482
13503
6541
3944
6183
13662
6575
7572
9554
10327
12301
4030
19618
10898
11311
8109
6427
14403
14434
8850
13227
7101
10980
10930
4126
5156
9999
13832
9865
7835
13533
10076
14144
10157
6568
6190
8149
9529
15668
8942
20996
10867
8155
19569
2367
2225
2895
4397
4362
4549
2096
4853
2517
2518
3389
3392
3386
5214
5296
5276
4696
4637
4674
4217
3557
3516
3508
2698
7282
7289
7257
3415
1892
6283
6267
6231
6249
5041
5052
5027
8011
6681
6688
6668
3157
10617
14037
6797
7616
7661
7906
5763
5673
12759
3008
5857
6935
2276
5432
5408
5474
8761
22626
7014
15974
7703
7793
7777
12256
17771
3344
4477
11734
11732
11768
9206
9235
4531
9330
14241
14288
18056
8379
7828
8682
8611
11519
3320
6510
9568
8123
3824
7307
6335
17518
7159
6352
10328
9880
8435
9685
15843
4038
13196
11361
12078
12077
12866
6830
15519
8957
11075
10984
10137
10385
13983
15187
6876
6870
10926
5825
14123
3874
5161
15124
8428
10154
3851
11896
14312
11816
12931
8921
9115
8357
9523
9920
9121
10863
9102
12971
12179
12151
20950
2941
2911
2990
1941
10333
2370
2480
2499
2853
2861
1502
4582
4566
4545
3987
3979
3356
2794
4767
4798
5278
3006
4616
4690
4658
4675
4285
4257
4205
3411
6219
6215
5951
5937
2195
5064
12678
8036
8014
3107
13347
3630
6709
7684
7620
5512
5569
5575
13436
7997
5754
5774
5678
4102
4140
12749
6492
5839
6965
8749
8721
8723
2263
14673
15373
7059
15921
7754
4322
3347
13005
5226
10214
9452
9401
9437
9471
9759
9751
4330
9332
22379
7453
7449
3558
20041
11473
12052
4086
12461
12497
9419
3072
11583
5411
10803
15237
7815
6394
12996
8182
7622
2623
8404
8408
9983
6087
7838
11286
11315
8159
9852
15068
14972
8563
8562
8643
12136
14980
14459
6039
6037
10807
10453
10498
10408
13892
10936
12066
10876
6145
10331
11059
3880
9723
6723
7806
10014
6102
6103
13870
6558
20316
18262
15164
17118
6072
11176
18977
10937
6048
11143
13183
12974
1291
2942
1044
1151
2379
4561
3907
3901
2097
2576
2782
3038
5308
5340
4632
4694
4668
4292
7209
7293
4483
5989
5947
5972
12601
8006
8009
6683
6669
3110
3155
10639
3650
3671
3677
6725
6731
7654
5509
5572
7902
5769
4976
4133
12718
12788
6436
6402
6451
5817
5895
6932
2766
5453
5450
5433
8317
8384
14697
7015
7057
7051
7022
7755
7774
16451
11779
9214
9278
9450
9312
16852
14224
3476
7431
7420
7443
9058
3048
10724
10775
11882
10103
17227
9032
15784
8961
6806
4228
8008
6524
9171
13681
13636
6463
6529
14153
4777
6413
9512
9509
9888
19051
8405
9684
9959
6110
6126
11253
11313
13251
3223
6837
5428
10085
14432
14449
6032
11071
11165
22836
10870
3848
7323
11006
13987
13932
8974
6502
10071
5824
6153
10166
3873
8585
12964
18264
8475
6376
6374
10522
6333
12127
12848
7378
13176
17160
9921
8938
14372
12544
11130
12178
11227
10823
16048
2910
2951
2341
2811
4375
2579
3319
3310
3222
2734
5213
5381
5375
5321
3568
3777
2668
7296
7277
3459
3429
4404
6236
5936
504
12688
12654
2435
8001
8051
6617
6692
10656
10600
3636
16941
6754
20274
2837
13453
13421
7955
7969
5761
5798
5641
5687
5661
4903
4900
6408
6433
4599
5801
5892
5849
5876
8344
21740
14606
7019
7783
12231
11735
11797
9221
9704
9757
11602
14709
14731
7490
3551
908
900
11476
3047
827
8201
22262
16375
15717
10063
13732
12472
12862
5187
8604
8607
11507
12159
13550
6585
10861
15209
9176
8122
6317
7578
8187
9582
14514
3528
12390
7360
9882
15067
9590
7536
13526
6626
8293
8294
15557
3812
8888
9142
9145
10484
8994
10935
17494
13548
7549
10316
11009
10092
6815
7596
7590
15539
5133
7859
10886
10927
6117
12014
6599
16056
11199
15671
9546
16735
6300
18443
19992
12120
19969
15040
8359
10189
9923
8881
7122
17416
11140
11111
14427
7131
16345
9833
18669
13574
12857
2975
1912
4303
4351
4562
3997
2032
2553
3212
2712
2784
2716
2751
4725
4700
3017
3064
4664
4212
7259
7276
7271
7263
3408
1865
4411
4401
5019
1261
6645
3198
1066
10653
10625
10650
10630
14067
3601
16971
6775
24773
13490
7962
5766
5692
5686
5637
4935
6924
549
5447
8335
8383
8399
8367
17607
8706
8794
8744
15979
7751
12289
17760
9219
9461
3358
9738
9372
9326
11630
11694
11678
14261
14782
7403
7450
3555
11471
11426
10713
10780
10758
8231
12081
18081
10141
1727
13710
12428
9410
12852
13236
8681
8625
7850
13587
6553
6586
11884
3428
15225
13650
7382
6313
15251
4779
9095
2373
6350
14580
14550
13889
8521
8101
14859
8459
8457
8490
11108
9624
6089
6080
6899
13199
11220
11387
8505
11250
10597
4178
19734
8805
10485
15178
10361
11054
6816
5127
13952
10883
15485
18162
10193
13879
3837
15149
15836
8512
8587
12562
11183
1823
18236
8573
8471
8478
6373
18520
14142
10363
12895
11119
11156
12830
9133
15138
9858
12926
9522
10187
14599
14596
7566
7568
10838
7300
12812
14378
9129
11523
10996
10813
10810
25564
12537
14356
17077
20836
18696
7333
2914
2939
1936
1965
2812
2884
2897
4588
3912
2016
4889
4888
3388
3261
4729
5280
3090
5315
5316
5343
4218
4250
3751
3732
2689
3488
3409
1611
16156
6268
5943
2110
2183
2100
5087
12651
8029
8038
6664
6614
14056
14055
1334
13361
16966
6707
6737
7689
7666
7642
13430
7901
7979
7970
5617
23018
4905
4198
4139
12717
12786
3172
5855
6938
4263
8386
17671
8759
22609
14641
7097
7055
15985
7782
12258
13012
13051
5220
10264
10237
9283
9293
9296
6296
9760
9368
14702
22394
746
7432
7469
7471
7463
7183
10708
8270
16265
15715
8932
4577
13299
8829
22059
8606
8652
8602
11518
11582
11541
18712
6584
6554
2523
10537
6061
4067
13695
9355
8120
11913
6302
7674
15258
12591
4344
16614
5190
7153
13105
9155
2922
6357
9640
14513
13590
9887
12368
9895
9682
9657
6088
6054
6086
8894
11310
9191
12071
9598
12097
5427
14443
4095
8873
8804
10559
6091
8856
10943
17456
10134
8593
19439
9254
5028
10388
10329
5122
12114
5134
14113
7818
10880
6104
21967
6872
11097
15000
15142
8666
16721
10167
13826
13822
13160
3879
13679
13677
8836
10144
8479
11196
6858
19021
6194
11813
19548
11597
8927
7171
7172
9857
19918
9926
8835
10564
7567
13696
21002
14920
13847
14875
10993
16598
23640
14830
12532
16070
14180
14415
12150
17997
16305
733
2880
4347
4349
1749
17971
4504
4551
2033
4802
3391
3288
3236
3294
2711
2756
4788
5277
3084
3065
5398
4692
4290
4251
3764
2666
7261
7270
3436
3462
1863
4469
4433
16100
6243
6228
5918
5979
5977
5025
5072
12693
660
6613
6694
3134
3165
10661
10643
14050
13393
3696
3644
6715
2479
7615
5554
13485
7985
7947
7978
5719
5767
5731
5612
5668
5674
496
4906
4904
4996
12741
5861
6941
6914
8329
8336
17666
17675
8704
8702
8769
14681
5360
7002
7092
15993
12253
12292
17797
13044
16488
16472
10275
11736
11749
11740
11773
9288
9280
9225
9457
9469
4623
9783
4333
9331
9339
11632
14268
14722
7425
7407
11495
11491
10742
10749
11864
8295
8273
22200
17224
4029
8375
15756
13772
8981
12487
12818
5181
5186
8828
8825
8680
8699
13507
11880
15224
7550
7303
7319
7312
7332
6318
6387
11828
10129
7111
7347
6157
10245
9559
9504
10033
14504
12329
7367
13806
8105
17818
11104
9602
9913
22550
11008
6628
17895
5423
18033
8871
20068
16675
8809
10580
7886
8950
10461
10448
10449
11161
13894
10946
8176
8170
10934
8228
7594
13982
13913
9078
16245
13537
3865
5826
6106
3831
15019
8833
8517
12980
12807
11194
12893
9534
11850
14389
9348
11945
20719
16589
4047
9971
12518
12513
14172
9528
6049
8862
17855
13905
21010
11021
14422
11992
10811
16298
23862
8151
8154
11563
12347
15800
17547
13126
15879
7551
2967
1191
2344
1444
2894
4396
4372
4379
4363
4515
4555
3980
2050
4841
3303
3202
3238
4756
4739
5218
5286
3012
5377
3518
3566
3734
3725
3758
3745
2699
3400
4403
4481
4488
16108
16140
16120
6233
2194
1262
12617
12672
12676
12673
8080
8056
8007
8055
8030
8065
8021
6685
6602
6632
6698
3103
3102
10689
10610
14052
14095
13325
13372
3700
3685
3629
7638
5507
13401
7977
5759
5781
5698
5644
5626
4962
4190
4151
4142
4127
12709
6432
5845
6931
5485
8748
14632
7094
12283
13002
13001
13073
10215
10260
10277
17305
25365
11713
11765
11744
9241
9200
9269
9298
9439
9447
5332
3355
9734
24629
9319
9390
11699
2726
22374
11484
11405
1076
10729
11819
5240
2228
5749
4165
4001
9036
4446
15760
15744
13714
8984
8965
8960
6835
6834
12405
3921
7857
18749
13585
6583
10882
9174
9178
9567
13637
9351
11915
7524
7335
7385
7339
6520
10970
8199
17506
11356
6353
10038
10037
14587
8537
12337
14853
8492
8458
15611
11105
9966
6041
8895
7831
18647
7840
12099
10010
14457
14445
8887
9143
9843
10850
7414
10481
10919
19445
7544
11024
3888
7597
13995
21482
9079
6368
9614
11646
8676
5820
10113
8555
15148
10372
10165
9939
8519
14883
8426
10723
11193
18405
11109
20132
9531
6566
17883
7866
7865
14387
10344
16827
20758
7376
10938
12573
17166
14160
7125
10844
13185
11115
17902
18850
14349
9575
12975
9831
9839
9247
14472
10960
12500
13855
13579
14352
12145
13805
22571
20620
12411
12049
23899
12181
14869
17847
14328
605
2935
2986
2958
2972
1986
2383
1439
2212
2201
2200
2852
4398
4508
4526
3933
2078
4809
4830
4838
3311
3295
2713
2733
3054
3097
4619
4604
4633
4213
4276
7251
7249
3425
1828
4432
6257
5981
12674
8026
3191
10632
3668
3673
6772
6771
7683
5564
13445
7936
7993
7994
2822
5724
5783
5786
5726
23055
12797
12798
5838
5879
5874
2274
8381
8309
8751
15395
7021
15903
15987
774
7796
7747
12269
17735
3349
13011
10209
10238
17337
9232
9725
9710
9761
9758
9745
9395
14279
14748
7461
7408
7427
9089
11417
11423
11818
820
8218
22201
5742
17235
2127
4054
9031
5927
19226
15755
12465
12881
13235
13209
22003
8661
8638
18961
11888
10859
10852
27953
9353
11826
14109
10974
9154
7343
6414
12341
12870
14250
9153
14882
8406
8450
8491
11291
11102
9653
6010
6894
6898
11287
11239
11312
9810
3226
12093
9168
16656
10590
6829
14919
10012
14402
4090
10589
10809
10800
10407
10402
10486
11076
11163
13899
11414
11320
10925
10916
17433
13546
10871
3843
12827
15810
9061
18684
9258
10577
10575
11843
7548
10399
11089
11013
10508
21137
16035
20463
21424
5151
5157
16530
15460
4182
15590
7923
3832
9931
3870
6178
12911
12912
15119
8427
10357
12226
10520
18344
15476
16782
16701
13623
6560
6199
6193
6071
14332
11812
8410
12128
11590
9346
17101
16514
12028
13174
4045
11031
12571
12511
13508
19155
10842
14922
10865
7130
18900
14136
6888
8157
12176
10102
16079
14290
13800
11226
13563
14574
4334
4305
1558
2058
4848
3335
3207
3244
4712
4799
4702
4747
5289
5291
4608
3573
3710
7241
7212
7239
7291
3401
3468
18551
4498
6220
5992
5010
5002
5055
12669
8004
6608
3142
1062
10608
10626
14061
13355
13374
16959
16907
6774
7687
5565
13400
13469
7913
7961
5736
5682
5607
5677
4953
4999
12782
6409
6400
3174
6997
6940
5484
5493
8348
8755
8770
21778
14684
14602
14669
7012
7080
7028
15910
15950
7756
7737
4315
16466
16468
10224
10283
10222
17308
11793
11746
9476
9771
9364
9305
11624
11698
3472
14725
14742
2326
23259
9009
11483
11464
11451
11475
10750
10776
8266
6470
16236
16270
17267
4084
16325
16339
15782
15704
13783
13754
8969
12834
4578
13237
21377
3120
19370
3328
18731
13535
13511
11886
10530
6064
6180
9563
11982
11959
11984
11904
7517
7556
6330
7678
5328
5327
3890
7156
6415
6410
6358
9584
13597
8533
8528
12363
9899
8100
8465
8496
6001
19699
8103
7845
9593
9594
8627
3810
13943
15568
8363
5177
10019
14455
7198
19729
9846
8800
10517
9043
3180
10940
10982
17466
19429
10874
11846
7321
8112
10319
11012
10096
11365
13911
13910
6726
4077
12100
9678
6328
15441
15490
13323
10410
10957
10075
15888
13674
8837
18534
12981
12961
12969
19076
5167
15103
19294
10352
9547
16780
9951
23563
23560
7895
11871
10558
11968
9851
19988
20787
23976
18361
18337
9114
11037
12584
12515
13954
6545
13097
11147
14374
13849
9826
23948
21047
7137
13154
9577
12973
12547
13994
14850
19588
11123
11132
12168
11560
8696
9501
9508
21820
12323
22877
12851
12410
17177
23308
15245
9876
17523
18074
13608
22195
21990
25590
18060
2924
2948
1975
2211
4373
1755
1708
4851
3353
3309
3307
3394
3286
4784
5241
5304
4601
4614
4698
4293
3795
7200
7242
4453
16119
16150
6255
6232
6240
5916
5017
5000
668
6659
6653
6655
3190
3147
1406
14059
13351
13362
13345
3704
3664
6717
6713
6702
6769
6770
24736
24737
7618
7656
7650
20269
5561
5598
13481
13426
7989
7980
7973
5606
5610
5636
5645
4130
12737
6497
4592
5425
8311
8385
8703
21715
22649
14685
14648
15302
701
7093
15941
7769
13019
13004
13072
16402
10241
10298
11711
11725
11767
11763
9488
9456
9492
9756
9736
9793
9746
9388
9387
9309
9369
11682
11655
11692
14280
14276
14227
14741
14780
14745
22392
22323
7455
7462
20080
9015
11434
11498
11447
10771
8206
20852
12084
10156
3796
21282
4057
22967
5920
8378
19200
15734
15750
15720
13717
8924
8936
12435
12420
12841
5189
13202
13275
8603
8635
8667
8608
3128
11552
18716
18794
13509
13504
6514
10534
15219
3800
6182
13682
13613
13661
13655
6576
8194
13159
17541
12902
7348
9517
10031
12317
12380
14806
8464
17881
5663
15658
11107
9654
9651
9632
15845
23312
6018
13647
7837
6128
6125
8814
11203
11200
11270
10899
11306
11304
11314
9835
15128
1663
16631
15517
15828
12130
7396
10089
10086
14481
14404
14498
19725
19742
10406
10468
10460
20898
13890
23106
8173
5148
19357
19487
12826
18651
9423
11845
11001
11069
19184
13919
21458
7862
9666
9671
21964
10922
17052
18160
5821
5822
10116
7928
23495
14228
18517
19134
13825
15013
8580
8557
5163
8473
18497
13621
9538
19023
11858
9130
21076
9349
15855
13147
13173
8140
9976
14179
8355
8939
7167
7128
11158
19878
18874
14370
9120
11520
18854
7132
14344
13551
23038
12545
6887
17811
11567
12172
9500
14353
15899
15863
12154
15520
20129
17005
23620
15696
2932
4306
4335
4583
391
3999
4863
2551
2563
3352
3334
3216
4701
5235
3069
4232
3717
2696
7207
3487
1845
4406
4431
4439
16135
6235
6259
6262
6265
6260
5957
5999
5950
5998
5945
2151
5018
5094
5040
5044
12635
12636
8024
8095
8039
8068
8074
8023
6641
6640
6676
3109
3197
3194
10631
10645
14006
14009
14014
13329
13332
13305
13375
13373
3632
16982
16967
16943
24716
7648
7672
2836
5582
5580
5530
13498
13444
13471
7917
7905
7960
7922
5685
5654
5699
5697
4970
4196
12701
6489
6480
6458
6420
5835
5873
6913
6951
6998
6908
17619
17626
8736
8760
8743
2266
2262
22657
14682
14652
14677
15317
15372
15328
7052
7050
15909
15990
15901
15949
12224
12281
12299
4310
13057
16404
10235
10295
10216
10201
10208
10227
11712
11780
9229
9403
9485
9762
9747
932
9381
9373
11689
14206
14204
14266
14265
14710
14762
25159
7441
7452
7400
7182
9002
11435
11490
11486
3046
10785
10747
8230
8221
12003
22212
16225
17278
15707
13789
13707
13758
13798
13738
13726
8941
8953
12495
12437
12859
22483
22463
13285
13264
13286
13279
8619
8695
8616
19330
18981
18966
10178
15806
15841
18790
18736
18743
12153
6588
2526
5520
20932
15214
15276
7811
26641
4060
13600
13639
11924
7557
11958
7399
23650
12592
12038
2977
6521
3379
14117
6577
7573
8196
8193
13109
17519
13110
5263
6416
10240
23782
23776
6351
6354
9643
11340
14585
10321
13594
12385
12336
12339
8529
14881
8497
8438
8468
13296
11293
15688
9625
9658
9967
4036
11241
11259
11285
11204
11260
10895
11388
8152
9889
13258
13250
9812
14242
8502
10423
16687
16602
8840
13948
13970
14915
14450
10582
7884
7416
6134
13891
11321
24182
8996
17488
19424
4828
10879
12358
18618
18681
11830
10573
10570
22294
7540
10311
10309
10310
11011
13245
5106
10473
7723
10542
12101
10250
8971
7864
22808
15621
16242
16240
6873
18166
6505
21871
15596
15593
12726
11098
23404
11808
18556
18507
10169
15648
15087
21921
8583
8550
12563
16855
18270
17569
12942
20340
5102
16258
14148
16001
15478
16730
16770
21140
18493
18448
18176
11159
12836
11856
14388
14313
9132
11878
16872
8926
12847
7370
18395
18398
22414
15150
4048
14526
10939
11032
16175
20826
8354
8350
15033
14169
9520
21351
13955
6546
13060
11570
19841
13908
12308
21069
22166
14377
9127
20994
23154
22990
13846
14423
15102
9572
19530
17346
14820
9240
12549
14195
18378
11137
9940
23421
18250
14947
12530
7144
7147
24507
13125
18248
14291
20576
12412
17171
23884
22076
18411
15415
15542
18822
17444
20154
19926
19825
23144
2980
2983
2450
1458
4354
4346
17551
4512
4509
3981
3900
4811
4850
4842
4877
3354
4715
4765
5217
5205
3030
5301
4655
4669
3756
3744
4487
16138
6295
6251
12697
8081
8052
8087
6624
6650
10603
10692
10660
14079
13324
13357
13394
13368
13340
13370
3606
3624
16919
16981
7643
5556
5529
13418
13468
13437
13446
13479
13423
7981
7988
7992
5789
5714
23054
490
4990
4939
4112
12703
12752
12761
12751
6494
5848
6995
6986
6948
6939
22729
22746
5482
8301
17668
8724
22663
14600
14622
15319
15334
15316
7087
7046
7070
7023
15952
15966
15947
7753
13025
13055
16477
10206
10299
10294
10292
17325
17383
11799
9237
4629
9732
9744
9306
11681
11615
14283
14264
14237
14736
14744
22330
7496
7491
7433
11450
11478
11463
10741
10783
10748
8286
3449
3443
12089
22209
6477
3605
15759
15738
15705
10066
10068
13741
13704
13778
8988
8925
12403
12457
12492
9411
12803
12819
5182
22456
13206
13265
8633
11516
11550
18932
10174
10177
3926
7854
12119
22817
5414
3423
3140
15265
15275
4069
11248
13667
13638
9354
9357
11910
7673
15254
23659
4943
6928
4771
13152
7346
11350
10248
23752
9648
14518
15558
7071
10026
12384
9884
9109
9164
19053
14862
8429
11627
15681
9617
9681
23329
6058
22507
7839
11231
11238
11324
11316
11336
11000
7848
14976
14939
10422
8566
15516
5175
14959
14916
10053
10081
10051
14493
14448
8884
5063
11539
10541
7415
6096
8851
10403
8248
22137
11169
11419
23554
11323
11938
8174
10909
10986
17465
10139
12061
19460
14963
6023
9063
18685
6143
15179
15174
7542
10381
10393
18811
11369
12116
16033
16037
13831
8975
14110
16500
22805
2426
15402
15401
15408
6877
10954
11647
8679
12951
11099
11093
10111
22816
18113
14127
27993
13820
15002
6860
6175
20325
8553
11188
18216
18205
18818
15118
16006
10155
17124
17164
16717
16729
16745
16708
18417
18418
18447
9958
11106
11141
22095
6076
11851
7896
19996
25558
25342
11598
7175
9850
19935
19989
22828
20745
8169
8163
23979
21151
12023
11974
13863
12585
25861
16098
8853
22248
7161
7121
18622
7305
11576
17045
8945
11149
21015
11522
11113
20028
16691
15421
19626
14194
14365
11569
19846
19847
15193
15574
22063
14540
21829
14357
18502
12143
23804
14292
14297
20570
18368
16895
24463
20626
23825
19527
10300
11223
15867
25868
19564
19974
22937
18595
18698
15508
25035
23354
20960
638
2915
2993
2960
19971
2890
4311
4587
3947
3305
2783
4733
5212
5234
5262
4211
3506
3579
7217
7219
7254
3413
4459
4434
4499
16162
628
6209
6205
5029
12641
12604
12614
12646
8032
8037
8072
6657
6637
6679
10618
10624
10634
10697
14057
14062
14078
14028
13304
13330
13346
13322
3691
1695
16980
6762
6740
769
7610
7699
7690
7655
7632
20241
20293
5584
5595
5583
5514
5548
5576
13482
13495
13450
23050
4950
4100
4138
12711
12780
12792
6485
6407
6466
5811
5888
5814
6917
6989
6994
6900
6977
2271
22731
4266
2767
5421
8327
17635
17648
17679
8783
8767
8772
21744
22671
14659
14683
14604
15361
15394
15375
7058
7091
15900
7717
7736
7773
7727
12264
17799
17772
13015
13007
13023
16461
10219
10259
10286
11730
11769
9207
9236
9267
9417
9495
9402
9486
9442
9421
9422
5338
9750
9749
24637
9382
9384
9301
9338
11688
11612
11660
11633
16853
16860
14203
14236
14277
3477
14718
14730
14747
14708
14743
22390
7417
7487
20004
23215
9003
9029
9001
11453
11461
11401
11420
11444
10731
10738
8280
8209
2086
12059
12080
12050
18082
10164
17211
17212
17295
17283
17261
21202
16379
8371
19260
19276
15711
15739
15722
15728
13785
13792
13737
8914
6819
4649
12418
12486
12438
12853
22448
22141
22153
26301
13269
8636
19311
19329
19376
11517
4708
2674
26705
6503
6065
15281
15229
15231
15266
11246
11245
13607
8126
7582
7552
7513
11951
7324
7361
24006
8542
8198
8195
17516
10126
16423
25553
9506
9647
14957
10044
19003
19083
15684
15615
15655
9915
6029
6055
11219
11229
11230
11266
10893
11331
9198
8141
9813
23913
18648
15069
9596
9691
12090
6833
10427
11256
16603
16688
16612
16697
16692
16639
10599
10595
15506
12131
14454
4094
9849
11536
16673
10535
10583
10808
6844
10856
10458
10469
20377
22131
11168
13896
10949
10947
8171
8175
17401
12063
12067
12820
15176
14531
10303
10304
10307
10332
11019
11004
11086
5128
4123
11064
5141
13989
13969
21441
21408
7726
8979
14112
7889
9077
10887
9663
20476
15468
17001
22105
11644
11642
10199
10190
10079
10070
12955
15594
5828
17876
17870
6159
8558
12191
3836
6551
16542
16540
15009
26169
7502
6590
8504
12952
18282
10149
5169
23578
18819
16255
7154
14143
16018
16368
12426
3854
16753
16714
16748
18481
6856
6850
20136
7899
17476
7863
14383
8413
12121
12126
8923
12845
18575
19956
19965
22821
7379
7373
7377
11500
18334
18399
16553
17195
12512
8803
20538
13069
7162
9028
10569
10568
15669
15166
24439
19835
11116
13848
22950
12370
10999
24298
15420
14340
9573
11996
16831
18444
17530
10814
10815
23039
23034
16595
14801
15573
18092
12171
7146
14359
13807
12885
16410
17178
13565
17148
12044
23810
17828
25294
16047
10905
17526
26037
21672
21895
13030
15505
17839
23851
25660
21122
25540
2931
2378
4389
4367
4541
4589
